/***********************************************************************************
 * 文件名称	:	fuzzycontrol.c
 * 文件说明	:	蜂鸣器驱动源文件
 * 作者		  :	蒲仁才
 * 库版本	  :	v3.5
 **********************************************************************************/
 
/************************************文件包含**************************************/
#include "fuzzycontrol.h"

/************************************函数声明**************************************/

/************************************全局变量**************************************/
const int Table_FuzzyControl[7][7]={
														//-3,-2,-1, 0, 1, 2,  3,},      
														 { 4, 4, 3, 3, 1, 0,  0,},   //-3 
														 { 4, 3, 3, 2, 1, 0, -1,},   //-2
														 { 3, 2, 2, 1, 0,-1, -2,},   //-1
														 { 2, 2, 1, 0,-1,-2, -2,},   // 0 
														 { 2, 1, 0,-1,-2,-2, -3,},   // 1 
														 { 1, 0,-1,-2,-3,-3, -4,},   // 2
														 { 0, 0,-2,-3,-3,-4, -4 }		 // 3
									 };
/***********************************************************************************
 * 函数名称	:	Fuzzy_Control
 * 函数功能	:	根据误差值和误差变化率经模糊控制输出量的变化
 * 参数列表	:	无
 * 返回类型	:	无
 * 调用方式	:	外部调动
 **********************************************************************************/
int Fuzzy_Control(int eErr,int eErrChangeRate)
{
		//判断误差值是否超出给定值的范围，如超出范围对峙进行处理
		if(eErr > 3)
		{
				eErr =  3 ;
		}
		else if(eErr < -3)
		{
				eErr = -3 ;
		}	
		
		//判断误差变化率是否超出给定值的范围，如超出范围对值进行处理
		if(eErrChangeRate > 3)
		{
				eErrChangeRate =  3 ;
		}
		else if(eErrChangeRate < -3)
		{
				eErrChangeRate = -3 ;
		}
		
		//返回根据误差值和误差变化率的值得到输出质的变化量
		return Table_FuzzyControl[eErr+3][eErrChangeRate+3];
}

